In [1]:
import sqlite3
import pandas as pd

In [2]:
# Create a SQL connection to our SQLite database
con = sqlite3.connect("database.sqlite")

In [3]:
# Toon alle countries
query = 'select * from Country;'

pd.read_sql(query, con).head()

      id     name
0      1  Belgium
1   1729  England
2   4769   France
3   7809  Germany
4  10257    Italy